Revit 2026 API

# EnergyDataSettingsServiceType Property

---

The type of heating or cooling system.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public gbXMLServiceType ServiceType { get; set; }
```
```vb
Public Property ServiceType As gbXMLServiceType
	Get
	Set
```
```cpp
public:
property gbXMLServiceType ServiceType {
	gbXMLServiceType get ();
	void set (gbXMLServiceType value);
}
```
```fsharp
member ServiceType : gbXMLServiceType with get, set
```

#### Property Value

gbXMLServiceType

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The service type does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace